Documents/ВключениеПрочегоИмуществаВСоставПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВключениеПрочегоИмуществаВСоставПИФ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияСделокСНедвижимостью</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоПрочимАктивам</xr:Item>
				<xr:Item>AccumulationRegister.ПрочееИмуществоПереданноеВОплатуПаев</xr:Item>
				<xr:Item>AccumulationRegister.ВводыВыводыАктивовВВалютеУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Имущество</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИмущества</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имущество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВводыВыводыАктивовВВалютеУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВводыВыводыАктивовВВалютеУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РыночнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииВводаВыводаДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗадолженностиПоПрочимАктивам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоПрочимАктивам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИмущества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Имущество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыАктивов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитныеВклады</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебиторскаяЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредиторскаяЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недвижимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмущественныеПрава</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обеспечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПраваАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Займы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйУчасток</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Здание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Помещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сооружение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйНедвижимыйКомплекс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектНезавершенногоСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиноМесто</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВводПрочихАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВводПрочихАктивов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоПрочимАктивам</xr:Item>
				<xr:Item>AccumulationRegister.ПрочееИмуществоПереданноеВОплатуПаев</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИмущества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Имущество</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имущество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВключениеПрочегоИмуществаВСоставПИФ/Ext/ObjectModule.bsl
Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВключениеПрочегоИмуществаВСоставПИФИмущество.ВидИмущества КАК ВидИмущества,
		|	ВключениеПрочегоИмуществаВСоставПИФИмущество.Имущество КАК Имущество,
		|	ВключениеПрочегоИмуществаВСоставПИФИмущество.Количество КАК Количество,
		|	ВключениеПрочегоИмуществаВСоставПИФИмущество.Сумма КАК Сумма,
		|	ВключениеПрочегоИмуществаВСоставПИФИмущество.Основание.Пайщик КАК ОснованиеПайщик,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.УчетныйАктив КАК УчетныйАктив,
		|	ВключениеПрочегоИмуществаВСоставПИФИмущество.Имущество.Представление КАК ИмуществоПредставление,
		|	РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости.ВидОбъектаНедвижимости КАК ВидОбъектаНедвижимости
		|ИЗ
		|	Документ.ВключениеПрочегоИмуществаВСоставПИФ.Имущество КАК ВключениеПрочегоИмуществаВСоставПИФИмущество
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ОбъектНедвижимости В
		|						(ВЫБРАТЬ
		|							ВключениеПрочегоИмуществаВСоставПИФИмущество.Имущество КАК Имущество
		|						ИЗ
		|							Документ.ВключениеПрочегоИмуществаВСоставПИФ.Имущество КАК ВключениеПрочегоИмуществаВСоставПИФИмущество)) КАК РеквизитыОбъектовНедвижимостиСрезПоследних
		|		ПО ВключениеПрочегоИмуществаВСоставПИФИмущество.Имущество = РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости
		|ГДЕ
		|	ВключениеПрочегоИмуществаВСоставПИФИмущество.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВидИмущества = Перечисления.ВидыАктивов.Недвижимость Тогда
			
			Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УчетныйАктив) Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить учетный актив для объекта недвижимости """ + ВыборкаДетальныеЗаписи.ИмуществоПредставление+ """", ЭтотОбъект,,,Отказ);
				Продолжить;
			КонецЕсли;
			
			НастройкиУчетаАктива = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
				Дата,
				Организация,
				СчетДоверительногоУправления,
				ВыборкаДетальныеЗаписи.УчетныйАктив,
				УчетныйРегистр);	
				
			Если ВыборкаДетальныеЗаписи.ВидОбъектаНедвижимости <> Перечисления.ВидыОбъектовНедвижимости.ЗемельныйУчасток
				И ВыборкаДетальныеЗаписи.УчетныйАктив <> Справочники.УчетныеАктивы.ТоварыКвартирыПомещения Тогда
				СчетУчета = ПланыСчетов.Основной.ВложенияВоВнеоборотныеАктивыСебестоимость;
			Иначе	
				СчетУчета = НастройкиУчетаАктива.СчетУчета;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СчетУчета) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить счета учета актива """ + ВыборкаДетальныеЗаписи.ИмуществоПредставление, ЭтотОбъект,,,Отказ);
				Продолжить;
			КонецЕсли;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ВыборкаДетальныеЗаписи.Сумма, "Поступление имущества");
			
			// Дт.
			Проводка.СчетДт = СчетУчета;
			Проводка.СубконтоДт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.Имущество;
			
			// Кт.
			Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
			Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.ОснованиеПайщик;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано проведение по БУ для вида имущства " + ВыборкаДетальныеЗаписи.ВидИмущества,ЭтотОбъект,,,Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствам.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствам.Контрагент КАК Контрагент,
		|	ЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма,
		|	ЗаявкаПайщика.Пайщик КАК Пайщик
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаПайщика КАК ЗаявкаПайщика
		|		ПО (ЗадолженностиПоДенежнымСредствам.Основание.Основание = ЗаявкаПайщика.Ссылка)
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.Регистратор = &Регистратор
		|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоПриобретеннымЦенностям)
		|	И ЗадолженностиПоДенежнымСредствам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|	И ЗадолженностиПоДенежнымСредствам.Организация = &Организация
		|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//выделим НДС
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ВыборкаДетальныеЗаписи.Сумма, "Выделен НДС");
		
		// дебет
		Проводка.СчетДт = ПланыСчетов.Основной.НДСПоПриобретеннымОС;
		Проводка.СубконтоДт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
		Проводка.СубконтоДт.СчетаФактуры = ВыборкаДетальныеЗаписи.Основание;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
		Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.Пайщик;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать 	= Истина;
	Движения.ВводыВыводыАктивовВВалютеУчета.Записывать 		= Истина;
	Движения.УсловияСделокСНедвижимостью.Записывать 		= Истина;
	
	ВалютаУчета = ЭтотОбъект.Организация.ВалютаУчета;
	
	ИФНСДляНДС = РегистрыСведений.ИФНСОрганизаций.ПолучитьИФНС(ЭтотОбъект.Дата, ЭтотОбъект.Организация, Истина);	
	Если НЕ ЗначениеЗаполнено(ИФНСДляНДС) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена ИФНС для организации по крупнейшим налогоплательщикам", ЭтотОбъект.Организация,,, Отказ);
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВключениеПрочегоИмуществаВСоставПИФ.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Ссылка.Организация КАК Организация,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Основание КАК Основание,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Основание.Пайщик КАК Пайщик,
		|	ВключениеПрочегоИмуществаВСоставПИФ.ВидИмущества КАК ВидИмущества,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Имущество КАК Имущество,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Количество КАК Количество,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Сумма КАК Сумма,
		|	МИНИМУМ(ЕСТЬNULL(ВводПрочихАктивовИмущество.Сумма, 0) - ЕСТЬNULL(ВводПрочихАктивовИмущество.СуммаБезНДС, 0)) КАК СуммаНДС,
		|	ПрочееИмуществоПереданноеВОплатуПаев.Регистратор КАК АктПриемаПередачи,
		|	МИНИМУМ(СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка) КАК СведенияОГосРегистрацииПраваСобственности,
		|	ВключениеПрочегоИмуществаВСоставПИФ.НомерСтроки КАК НомерСтроки,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Имущество.Представление КАК ИмуществоПредставление,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка) КАК КоличествоРегистрацийПраваСобственности
		|ИЗ
		|	Документ.ВключениеПрочегоИмуществаВСоставПИФ.Имущество КАК ВключениеПрочегоИмуществаВСоставПИФ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочееИмуществоПереданноеВОплатуПаев КАК ПрочееИмуществоПереданноеВОплатуПаев
		|		ПО ВключениеПрочегоИмуществаВСоставПИФ.Имущество = ПрочееИмуществоПереданноеВОплатуПаев.Имущество
		|			И (ПрочееИмуществоПереданноеВОплатуПаев.Организация = &Организация)
		|			И (ПрочееИмуществоПереданноеВОплатуПаев.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|			И (ПрочееИмуществоПереданноеВОплатуПаев.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|			И ВключениеПрочегоИмуществаВСоставПИФ.Основание = ПрочееИмуществоПереданноеВОплатуПаев.Основание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводПрочихАктивов.Имущество КАК ВводПрочихАктивовИмущество
		|		ПО (ПрочееИмуществоПереданноеВОплатуПаев.Регистратор = ВводПрочихАктивовИмущество.Ссылка)
		|			И ВключениеПрочегоИмуществаВСоставПИФ.Имущество = ВводПрочихАктивовИмущество.Имущество
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОРегистрацииПраваСобственности.ОбъектыНедвижимости КАК СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости
		|		ПО ВключениеПрочегоИмуществаВСоставПИФ.Имущество = СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.ОбъектНедвижимости
		|			И ВключениеПрочегоИмуществаВСоставПИФ.Основание = СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Основание
		|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Организация = &Организация)
		|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|			И (СведенияОРегистрацииПраваСобственностиОбъектыНедвижимости.Ссылка.Проведен)
		|ГДЕ
		|	ВключениеПрочегоИмуществаВСоставПИФ.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВключениеПрочегоИмуществаВСоставПИФ.Ссылка.Дата,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Ссылка.Организация,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Ссылка.СчетДоверительногоУправления,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Основание,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Основание.Пайщик,
		|	ВключениеПрочегоИмуществаВСоставПИФ.ВидИмущества,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Имущество,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Количество,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Сумма,
		|	ПрочееИмуществоПереданноеВОплатуПаев.Регистратор,
		|	ВключениеПрочегоИмуществаВСоставПИФ.НомерСтроки,
		|	ВключениеПрочегоИмуществаВСоставПИФ.Имущество.Представление
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	ВидИмущества,
		|	Основание";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВидИмущества = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВидИмущества.Следующий() Цикл
		
		Если Не Отказ Тогда
			Движение = Движения.ВводыВыводыАктивовВВалютеУчета.Добавить();
			
			Движение.Период 						= ЭтотОбъект.Дата;
			Движение.Организация 					= ЭтотОбъект.Организация;     
			Движение.СчетДоверительногоУправления 	= ЭтотОбъект.СчетДоверительногоУправления;
			Движение.НаправлениеДвижения 			= Перечисления.ВидыДвижений.Приход;
			Движение.ВидАктива 						= ВыборкаВидИмущества.ВидИмущества;
			Движение.БалансоваяСтоимость 			= ВыборкаВидИмущества.Сумма;
			Движение.РыночнаяСтоимость 				= ВыборкаВидИмущества.Сумма;
		КонецЕсли;	
		
		ВыборкаОснование = ВыборкаВидИмущества.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОснование.Следующий() Цикл
			
			Если Не Отказ Тогда
				Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
				
				Движение.Период = ЭтотОбъект.Дата;
				Движение.Основание = ВыборкаОснование.Основание;
				Движение.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская;
				Движение.ВидЗадолженности = Справочники.ВидыЗадолженности.ПередПайщиками;
				Движение.Организация = ЭтотОбъект.Организация;
				Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
				Движение.Валюта = ВалютаУчета;
				Движение.Контрагент = ВыборкаОснование.Пайщик;
				Движение.Аванс = Истина;
				Движение.Сумма = ВыборкаОснование.Сумма;
				
			КонецЕсли;
			
			ВыборкаДетальныеЗаписи = ВыборкаОснование.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Движение = Движения.ПрочееИмуществоПереданноеВОплатуПаев.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
				
				Если ВыборкаДетальныеЗаписи.СуммаНДС <> 0 Тогда
					Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
					
					Движение.Период = ЭтотОбъект.Дата;
					Движение.Основание = ВыборкаДетальныеЗаписи.АктПриемаПередачи;
					Движение.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская;
					Движение.ВидЗадолженности = Справочники.ВидыЗадолженности.НДСПоПриобретеннымЦенностям;
					Движение.Организация = ЭтотОбъект.Организация;
					Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
					Движение.Валюта = ВалютаУчета;
					Движение.Контрагент = ИФНСДляНДС;
					Движение.Аванс = Ложь;
					Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаНДС;
					
				КонецЕсли;

				Если ВыборкаДетальныеЗаписи.ВидИмущества = Перечисления.ВидыАктивов.Недвижимость Тогда
					
					Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.АктПриемаПередачи) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден документ приема-передачи для объекта недвижимости " 
							+ ВыборкаДетальныеЗаписи.ИмуществоПредставление, 
							ЭтотОбъект, "Имущество[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Имущество",, Отказ);
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СведенияОГосРегистрацииПраваСобственности) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдено сведетельство о регистрации права собственности для объекта недвижимости " 
							+ ВыборкаДетальныеЗаписи.ИмуществоПредставление, 
							ЭтотОбъект, "Имущество[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Имущество",, Отказ);
					КонецЕсли;
					
					Если ВыборкаДетальныеЗаписи.КоличествоРегистрацийПраваСобственности >1 Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Найдено более одного сведетельства о регистрации права собственности для объекта недвижимости " 
							+ ВыборкаДетальныеЗаписи.ИмуществоПредставление, 
							ЭтотОбъект, "Имущество[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Имущество",, Отказ);
					КонецЕсли;
					
					Если Не Отказ Тогда
						Движение = Движения.УсловияСделокСНедвижимостью.Добавить();
						Движение.Период = ЭтотОбъект.Дата;
						Движение.Организация = ЭтотОбъект.Организация;
						Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
						Движение.Основание = ВыборкаОснование.Основание;
						Движение.ОбъектНедвижимости = ВыборкаДетальныеЗаписи.Имущество;
						Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
						Движение.АктПриемаПередачи = ВыборкаДетальныеЗаписи.АктПриемаПередачи;
						Движение.СведенияОГосРегистрацииПраваСобственности = ВыборкаДетальныеЗаписи.СведенияОГосРегистрацииПраваСобственности;
						Движение.Отменено = Ложь;
					КонецЕсли;
						
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.ПрочееИмуществоПереданноеВОплатуПаев.Записать();
	Движения.ЗадолженностиПоПрочимАктивам.Записать();
	
	//Проверки
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.КоличествоОстаток < 0 КАК ВключеноБольшеПолученного,
		|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.КоличествоОстаток = 0
		|		И ПрочееИмуществоПереданноеВОплатуПаевОстатки.СуммаОстаток <> 0 КАК ПринятаНеВсяСтоимость,
		|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.Основание.Представление КАК ОснованиеПредставление,
		|	ПрочееИмуществоПереданноеВОплатуПаевОстатки.Имущество.Представление КАК ИмуществоПредставление
		|ИЗ
		|	РегистрНакопления.ПрочееИмуществоПереданноеВОплатуПаев.Остатки(
		|			&МоментВремени,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Основание В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВключениеПрочегоИмуществаВСоставПИФИмущество.Основание КАК Основание
		|					ИЗ
		|						Документ.ВключениеПрочегоИмуществаВСоставПИФ.Имущество КАК ВключениеПрочегоИмуществаВСоставПИФИмущество
		|					ГДЕ
		|						ВключениеПрочегоИмуществаВСоставПИФИмущество.Ссылка = &Ссылка)) КАК ПрочееИмуществоПереданноеВОплатуПаевОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ВключеноБольшеПолученного Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В состав Фонда включено больше имущества, чем получено (" 
				+ ВыборкаДетальныеЗаписи.ИмуществоПредставление + ", " 
				+ ВыборкаДетальныеЗаписи.ОснованиеПредставление + "). Разница = " + ВыборкаДетальныеЗаписи.КоличествоОстаток, ЭтотОбъект,,,Отказ);
		ИначеЕсли ВыборкаДетальныеЗаписи.ПринятаНеВсяСтоимость Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Стоимость переданного имущества не соответствует стоимости имущества, включенного в состав Фонда (" 
				+ ВыборкаДетальныеЗаписи.ИмуществоПредставление + ", " 
				+ ВыборкаДетальныеЗаписи.ОснованиеПредставление + "). Разница = " + ВыборкаДетальныеЗаписи.СуммаОстаток, ЭтотОбъект,,,Отказ);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не включено в состав Фонда переданное имущество (" 
				+ ВыборкаДетальныеЗаписи.ИмуществоПредставление + ", " 
				+ ВыборкаДетальныеЗаписи.ОснованиеПредставление + ")", ЭтотОбъект,,,Отказ);
		КонецЕсли;
			
	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоПрочимАктивамОстатки.Основание.Представление КАК ОснованиеПредставление,
		|	ЗадолженностиПоПрочимАктивамОстатки.Имущество.Представление КАК ИмуществоПредставление,
		|	ЗадолженностиПоПрочимАктивамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЗадолженностиПоПрочимАктивамОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоПрочимАктивам.Остатки(
		|			&МоментВремени,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Основание В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВключениеПрочегоИмуществаВСоставПИФИмущество.Основание КАК Основание
		|					ИЗ
		|						Документ.ВключениеПрочегоИмуществаВСоставПИФ.Имущество КАК ВключениеПрочегоИмуществаВСоставПИФИмущество
		|					ГДЕ
		|						ВключениеПрочегоИмуществаВСоставПИФИмущество.Ссылка = &Ссылка)) КАК ЗадолженностиПоПрочимАктивамОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не все имущество принято в состав Фонда (" 
			+ ВыборкаДетальныеЗаписи.ИмуществоПредставление + ", " + ВыборкаДетальныеЗаписи.ОснованиеПредставление + ")"
			, ЭтотОбъект,,,Отказ);
	КонецЦикла;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда

	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
